{
  "users": [
    {
      "id": 1,
      "username": "json-server",
      "email":"user1@gmail.com",
      "password":"12345"
    },
     {
      "id": 2,
      "username": "Elon",
      "email":"elon@gmail.com",
      "password":"1234"
    }
  ],
  "recipes":[
  {
		"id" : 1,
		"username" : "coreyschafer",
		"title" : "Hazelnut Brownies",
		"image" : "https://www.imperialsugar.com/sites/default/files/recipe/Nutella-Hazelnut-Brownies-imperial.jpg",
	  "description" : "Chocolate hazelnut spread ensures these moreish brownies have a fudgy centre. Flecked with pecans and sea salt - they'll be the new go-to brownie recipe",
		"category" : "Dessert",
		"ingredients" : ["Hazelnut", "Dark chocolate", "Flour","Eggs"],
		"instructions" : "Heat oven to 180C/160C fan/ gas 4. Butter and line the base and sides of a 20cm square tin. Put the butter, chocolate and chocolate spread in a heatproof bowl and melt over a pan of lightly simmering water. Once melted, stir and set aside to cool a little.In another bowl, use an electric whisk to beat the eggs and sugar together for 5 mins until light and fluffy. Pour in the chocolate mixture and whisk briefly to combine. Sift in the flour and gently fold through the mixture, then add most of the pecans. Scrape the mixture into the tin and spread out with a spatula. Scatter over the last of the pecans and a good sprinkling of sea salt.Bake for 30-35 mins until set but a little gooey in the middle. Cool, then cut into squares and serve with ice cream and caramel sauce."	
  },
  {"id" : 2,
  "category" : "Dessert",
    "Name": "Christmas poussin",
   "url": "https://www.bbcgoodfood.com/recipes/5028/christmas-poussin", 
   "Description": "Prepare ahead and pop in the oven when your guests arrive. Perfect if you don't want to be tied to the kitchen", 
   "Author": "Barney Desmazery", 
   "Ingredients": ["50g butter, softened", "4 poussin", "4 rashers smoked streaky bacon, halved", "1 tbsp plain flour", "1 tbsp Worcestershire sauce", "stock from vegetables (see 'goes well with')"], 
   "Method": ["Heat oven to 230C/fan 210C/gas 8. Smear the butter all over the poussins, season inside and out, then criss-cross the bacon over each one. Sit the poussins in a roasting tin and cook for 40 mins until the birds are golden and the bacon is crisp. Remove from the tin, leave to rest and set the tin aside until you’re ready to make the gravy.", "About 5 mins before you sit down to eat, make the gravy. Place the tin on a medium heat, then stir in the flour and splash in the Worcestershire sauce. Bubble together, then drain the veg over the roasting tin and stir in the vegetable stock. Bring the gravy to the boil, taste for seasoning, adding more Worcestershire sauce if needed, then pour into a warm gravy jug."]
  },

{
  "id" : 3,
  "category" : "Dessert",
  "Name": "Mary Berry's Christmas chutney", "url": "https://www.bbcgoodfood.com/recipes/1158/mary-berrys-christmas-chutney", "Description": "A perfect match for cheese and cold meats, and delicious in turkey sandwiches", "Author": "Mary Berry", "Ingredients": ["900g tomato", "3 red peppers, 1 large aubergine and 1 green pepper (total weight of about 900g/2lb)", "700g onion, peeled and fairly finely chopped, by hand or in a food processor", "4 fat cloves garlic, crushed", "350g granulated sugar", "300ml/½pint white wine vinegar or distilled malt vinegar", "1 tbsp salt", "1 tbsp coriander seeds, crushed", "1 tbsp paprika", "2 tsp cayenne pepper"], "Method": ["Peel the tomatoes - prick them with a sharp knife, place in a bowl and cover with boiling water. Leave for a few seconds then drain and cover with cold water. The skins will now come away easily.", "Chop the tomatoes and aubergine and seed and chop the peppers. Put in a large heavy-based pan with the onions and garlic and bring to the boil. Cover with a lid, lower the heat and gently simmer for about one hour, stirring occasionally, until tender.", "Tip the sugar, vinegar, salt, coriander, paprika and cayenne into the pan and bring to the boil over a medium heat, stirring, until the sugar has dissolved. Continue to boil for 30 minutes or so, until the mixture achieves a chunky chutney consistency and the surplus watery liquid has evaporated. Take care towards the end of the cooking time to continue stirring so that the chutney doesn't catch on the bottom of the pan.", "Ladle the chutney into sterilised or dishwasher-clean jars (Kilner jars are ideal) and top with paper jam covers. Seal the jars while still hot. Leave to mature for at least a month in a cool dark place."]},
{
  "id" : 4,
  "category" : "Main Course",
  "Name": "Make & mature Christmas cake", "url": "https://www.bbcgoodfood.com/recipes/2607642/make-and-mature-christmas-cake", "Description": "25 min prep time? More like an hour.", "Author": "James Martin", "Ingredients": ["1kg mixed dried fruit(use a mix of raisins, sultanas, currants, cherries, cranberries, prunes or figs)", "zest and juice 1 orange", "zest and juice 1 lemon", "150ml brandy, Sherry, whisky or rum, plus extra for feeding", "250g pack butter, softened", "200g light soft brown sugar", "175g plain flour", "100g ground almond", "½ tsp baking powder", "2 tsp mixed spice", "1 tsp ground cinnamon", "¼ tsp ground cloves", "100g flaked almond", "4 large eggs", "1 tsp vanilla extract"], "Method": ["Put 1kg mixed dried fruit, the zest and juice of 1 orange and 1 lemon, 150ml brandy or other alcohol, 250g softened butter and 200g light, soft brown sugar in a large ", " set over a medium heat.", "Bring to the boil, then lower the heat and simmer for 5 mins. Tip the fruit mixture into a large ", " and leave to cool for 30 mins.", "Heat oven to 150C/130C fan/gas 2. Line a deep 20cm cake tin with a double layer of ", ", then wrap a double layer of newspaper around the outside – tie with string to secure.", "Add 175g plain flour, 100g ground almonds, ½ tsp baking powder, 2 tsp mixed spice, 1 tsp ground cinnamon, ¼ tsp ground cloves, 100g flaked almonds, 4 large eggs and 1 tsp vanilla extract to the fruit mixture and stir well, making sure there are no pockets of flour.", "Tip into your prepared tin, level the top with a ", " and bake in the centre of the oven for 2 hrs.", "Remove the cake from the oven, poke holes in it with a skewer and spoon over 2 tbsp of your chosen alcohol. Leave the cake to cool completely in the tin.", "To store, peel off the baking parchment, then wrap well in cling film. Feed the cake with 1-2 tbsp alcohol every fortnight, until you ice it.", "Don’t feed the cake for the final week to give the surface a chance to dry before icing."]},
{
  "id" : 5,
  "category" : "Main Course",
  "Name": "Christmas muffin mix", "url": "https://www.bbcgoodfood.com/recipes/2920/christmas-muffin-mix", "Description": "A festive treat to give or receive", "Author": "Good Food", "Ingredients": ["300g self-raising flour", "2 tsp baking powder", "2 tsp ground cinnamon", "2 tsp ground mixed spice", "100g pecan or walnuts", "140g tropical dried fruit medley", "100g light muscovado sugar"], "Method": ["Layer all the ingredients in a 1 litre glass or plastic preserving jar in the order the ingredients are listed.", "Write the following method on a gift label: ‘Tip the contents of the jar into a large mixing bowl. Make a well in the centre and add 2 beaten eggs, 300ml/½pt milk and 100g/4oz melted butter. Mix quickly and lightly to a soft batter. Divide between 12 muffin cases. Bake at 190C/fan 170C/gas 5 for 18-20 mins. Use within 4 weeks.’ Attach the label and a wooden spoon to the top of the jar with some raffia or coloured ribbon."]},
{
  "id" : 6,
  "category" : "Main Course",
  "Name": "Sparkling vanilla Christmas cookies", "url": "https://www.bbcgoodfood.com/recipes/2798/sparkling-vanilla-christmas-cookies", "Description": "Easy to make. I did add a splash of milk though. Fun way to spend a rainy afternoon with the kids.", "Author": "Lesley Waters", "Ingredients": ["140g icing sugar, sieved", "1 tsp vanilla extract", "1 egg yolk", "250g butter, cut into small cubes", "375g plain flour, sieved", "200g icing sugar, sieved", "edible food colouring, optional", "edible gold and silver balls", "approx 2m thin ribbon cut into 10cm lengths"], "Method": ["Tip the icing sugar, vanilla extract, egg yolk and butter into a mixing bowl, then stir together with a wooden spoon (or pulse in a food processor until well combined). Add the flour and mix to a firm dough. Shape the dough into two flat discs and wrap in clingfilm. Chill for 20-30 mins. Heat oven to 190C/fan 170C/gas 5 and line two baking sheets with non-stick baking paper.", "Roll out the dough on a lightly floured surface to about the thickness of two £1 coins. Cut out Christmassy shapes (use a cutter if you like) and place on the baking sheets. Using the tip of a skewer, cut a small hole in the top of each cookie. Bake for 10-12 mins until lightly golden.", "Lift the biscuits onto a wire rack to cool. Meanwhile, mix the icing sugar with a few drops of cold water to make a thick, but still runny icing. Colour with edible food colouring, if you like. Spread it over the cooled biscuits, decorate with edible balls and thread with ribbon when dry."]},
{
  "id" : 7,
  "category" : "Starter",
  "Name": "Christmas pudding with citrus & spice", "url": "https://www.bbcgoodfood.com/recipes/8370/christmas-pudding-with-citrus-and-spice", "Description": "A fruity pud, served with orange custard cream, makes the perfect end to the traditional Christmas meal", "Author": "Sara Buenfeld", "Ingredients": ["175g each raisin, currants and sultanas", "140g whole glacé cherry", "50g mixed peel", "50g whole blanched almond", "zest 1 orangeand 1 lemon", "1 medium carrot, peeled and finely grated", "150ml brandy", "50ml/2fl oz orangeliqueur, such as Grand Marnier", "175g light muscovado sugar", "175g fresh white breadcrumb", "125g self-raising flour", "1 tsp mixed spice", "¼ tsp grated nutmeg", "175g butter, frozen", "2 eggs, beaten", "butter, for greasing", "hollysprig, to decorate"], "Method": ["Mix the fruit, almonds, citrus zests and the carrot with the brandy and orange liqueur in a large mixing bowl. Cover and leave to soak overnight.", "Mix all the dry ingredients together, then add to the soaked fruit mixture. Grate in the butter, then add the eggs and stir. Don’t forget to make a wish!", "Grease a 1.5-litre pudding basin with butter and line the base with greaseproof paper. Spoon in the mixture, press down well and make a hollow with the back of the spoon in the centre. Cover the surface with a round of greaseproof paper, then cover the bowl with double-thickness greaseproof paper and foil and tie at the rim with string. Lower the pudding into a pan with an upturned saucer in the base, then fill with water until it comes halfway up the sides of the bowl. Steam for 6 hrs, topping up with water as necessary.", "Alternatively, steam in the oven. Stand the pudding basin in a roasting tin filled with water, then cover with a tent of foil and cook for the same length of time at 160C/fan 140C/gas 3. Check roasting tin occasionally as the water may need to be topped up.", "To store, allow to cool, then store in a cool, dry cupboard. The pudding will keep for up to a year.", "On the day, steam for 1 hr before turning out, decorating with holly and serving with extra-thick double cream or vanilla ice cream. Alternatively, try my Orange custard cream (below)."]},
{
  "id" : 8,
  "category" : "Starter",
  "Name": "Fig & honey Christmas cake", "url": "https://www.bbcgoodfood.com/recipes/13381/fig-and-honey-christmas-cake", "Description": "This traditional Christmas cake is the perfect combination of fruit, nuts and spices", "Author": "James Martin", "Ingredients": ["750g mixed dried fruit", "100g blanched whole almond, roughly chopped", "100g chopped peel", "200g dried fig, roughly chopped", "100g glacé cherry, well rinsed and quartered", "300g plain flour", "1 tsp ground cinnamon", "1 tsp grated nutmeg", "zest 1 lemon", "250g lightly salted butter", "250g light muscovado sugar", "1 tsp vanilla extract", "2 tbsp clear honey", "1 tbsp black treacle", "4 large eggs", "½ tsp bicarbonate of soda", "1 tbsp milk", "3 tbsp brandy, plus extra to feed"], "Method": ["Heat oven to 140C/120C fan/gas 1. Line the base and sides of a 20cm cake tin first with a double layer of brown paper, then with a double layer of baking parchment. In a large bowl, mix the fruit, almonds, peel, figs and cherries. Turn well and add the flour, spices and lemon zest. In a separate bowl, cream the butter and sugar thoroughly, then add the vanilla extract, honey and treacle. Still beating, incorporate the eggs, then stir in the fruit and flour mixture. Dissolve the bicarbonate of soda in the milk and stir in thoroughly. Add the brandy by the spoonful, until you have a soft dropping consistency.", "Turn the batter into the cake tin and make a dip in the middle using the back of a spoon. Bake for 3½ hrs, then insert a skewer – if it comes out clean, it’s ready. If there is any cake mix on the skewer, give it 10 mins more and test again. When it’s done, remove the cake from the oven and leave to cool in its tin. The next day, remove from the tin, wrap in fresh greaseproof paper, then put it into an airtight tin or wrap tightly in foil. The usual thing is to keep the cake for at least a month before icing it, and to unwrap and sprinkle it occasionally with more brandy."]},
{
  "id" : 9,
  "category" : "Starter",
  "Name": "Angela Nilsen's Christmas cake", "url": "https://www.bbcgoodfood.com/recipes/1004/angela-nilsens-christmas-cake", "Description": "A long-life Christmas cake that's bursting with flavours of spices and vanilla", "Author": "Angela Nilsen", "Ingredients": ["200g butter, softened to room temperature", "200g dark muscovado sugar", "200g plain flour", "4 eggs, beaten", "50g ground almond", "100ml sherry, sweet or dry, whatever you have in the cupboard", "85g candied peel, roughly chopped (we used Sundora)", "85g glacé cherry, roughly chopped", "250g raisin", "250g currant", "100g pack pecan nuts, broken into big pieces", "finely grated zest 1 lemon", "1½ tsp mixed spice", "1½ tsp rosewater", "½ tsp vanilla extract", "½ tsp baking powder"], "Method": ["Heat oven to 160C/fan 140C/gas 3. Line the base and sides of a 20 cm round, 7.5 cm deep cake tin. Beat the butter and sugar with an electric hand mixer for 1-2 mins until very creamy and pale in colour, scraping down the sides of the bowl half way through. Stir in a spoonful of the flour, then stir in the beaten egg and the rest of the flour alternately, a quarter at a time, beating well each time with a wooden spoon. Stir in the almonds.", "Mix in the sherry (the mix will look curdled), then add the peel, cherries, raisins, cherries, nuts, lemon zest, spice, rosewater and vanilla. Beat together to mix, then stir in the baking powder.", "Spoon mixture into the tin and smooth the top, making a slight dip in the centre. Bake for 30 mins, then lower temperature to 150C/fan 130C/gas 2 and bake a further 2-2¼ hrs, until a skewer insterted in the middle comes out clean. Leave to cool in the tin, then take out of the tin and peel off the lining paper. When completely cold, wrap well in cling film and foil to store until ready to decorate. The cake will keep for several months."]},
{
  "id" : 10,
  "category" : "Main Course",
  "Name": "Gingery Christmas cake", "url": "https://www.bbcgoodfood.com/recipes/4825/gingery-christmas-cake", "Description": "A good glug of ginger wine makes this cake a little different from the norm. It's also lighter than its predecessors, so you can have two pieces!", "Author": "Emma Lewis", "Ingredients": ["350g raisin", "125g currant", "125g sultana", "200ml ginger wine, plus 4tbsp", "200g butter, softened, plus extra for greasing", "200g dark muscovado sugar", "4 eggs", "200g plain flour", "50g ground almond", "½ tsp mixed spice", "1 tsp ground ginger", "1 tsp freshly grated root ginger", "1 tbsp treacle"], "Method": ["Tip the raisins, currants and sultanas into a bowl. Pour over 200ml ginger wine, then cover and leave to sit at room temperature overnight so that the fruit plumps up.", "Heat oven to 160C/fan 140C/gas 3. Using the bottom of a 20cm, loose-bottomed cake tin as a template, cut out 2 circles of baking parchment. Then cut 2 thick strips (about 2cm deeper than the tin) that will fit around the inside of the tin. Make small cuts along one of the edges, about 2cm apart. Grease the tin, then place one parchment circle at the bottom. Place one strip inside the tin, making sure the cut side is at the bottom, as this will help you to fit it inside. Do the same with the remaining strip, then place the second circle on top (see step-by-step).", "Put the butter and sugar into a mixing bowl and whisk with an electric beater until creamy and light, about 5 mins. Add the eggs, one at a time, making sure you stir well after each addition, then mix through the flour, ground almonds and spices. Stir in the soaked fruits, and any liquid left over, with the fresh root ginger and treacle until everything is well combined.", "Spoon in the mixture and smooth the top, then use a spoon to make a slight dip in the centre. This will ensure the cake has an even surface when finished. Bake for 30 mins, then lower the oven to 150C/fan 130C/gas 2 and bake for another 2 hrs until a skewer inserted in the middle comes out clean. Skewer the cake all over, then drizzle over the remaining 4 tbsp ginger wine. Leave the cake to cool in the tin, then peel off the lining paper. To store, wrap first in baking parchment and then in tin foil. The cake will keep in a cupboard for up to 3 months or can be frozen for up to 6 months."]},
{
  "id" : 11,
  "category" : "Dessert",
  "Name": "Gordon's Christmas roast goose", "url": "https://www.bbcgoodfood.com/recipes/2428/gordons-christmas-roast-goose-", "Description": "Seriously, if you’re looking at this before December you are too obsessed with Christmas, stop.", "Author": "Gordon Ramsay", "Ingredients": ["4-5½ kg fresh goose", "4 lemons", "3 limes", "1 tsp Chinese five-spice powder", "small handful each of parsley sprigs, thyme and sage, plus extra for garnishing", "a little olive oil, for browning, optional", "3 tbsp clear honey", "1 tbsp thyme leaves"], "Method": ["Calculate the cooking time: cook for 10 mins at 240C/fan 220C/gas 9, then reduce to 190C/fan 170C/gas 5 and cook for 20 mins per kg for medium-rare, 32 mins per kg for more well done, plus 30 mins resting.", "If the goose is ready-trussed, then loosen the string and pull out the legs and wings a little – this helps the bird cook better.", "Check the inside of the bird and remove any giblets or pads of fat. Using the tip of a sharp knife, lightly score the breast and leg skin in a criss-cross. This helps the fat to render down more quickly during roasting.", "Grate the zest from 4 lemons and 3 limes. Mix with 2 tsp fine sea salt, 1 tsp Chinese five-spice powder and pepper, to taste.", "Season the cavity of the goose generously with salt, then rub the citrus mix well into the skin and sprinkle some inside the cavity.", "Stuff the zested fruit and a small handful of parsley, thyme and sage sprigs inside the bird and set aside for at least 15 mins. ", "Heat oven to 240C/fan 220C/gas 9.", "If you want to give the bird a nice golden skin, brown in a large ", " (or a heavy-based ", "), using a couple of tbsp olive oil. Holding the bird by the legs (you may like to use an oven glove), press it down on the breasts to brown.", "Once browned, place the bird in the roasting tin. Drizzle with 3 tbsp clear honey and sprinkle with 1 tbsp thyme leaves.", "Roast for the calculated time, turning the heat down after 10 mins to 190C/fan 170C/gas 5. Cover the goose with foil if it is starting to brown too much.", "Every 30 mins or so, baste the bird with the pan juices, then pour off the fat through a sieve into a large heatproof bowl. You will end up with at least a litre of luscious fat – save this for the potatoes and other veg.", "At the end of the cooking time, leave to rest for at least 30 mins, covered loosely with foil. The bird will not go cold, but will be moist and much easier to carve."]},
]
 
  
  
}